Catalogs/ЗаявлениеОПредоставленииКопииСудебногоАкта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ЗаявлениеОПредоставленииКопииСудебногоАкта</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Договоры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеСуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Суды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОДолжника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРожденияДолжника</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРегистрацииДолжника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортныеДанныеДолжника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРожденияДолжника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПервоначальногоКредитора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговораЦессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговораЦессии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКредитногоДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКредитногоДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеЗаявителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСудебногоДела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСудебногоДела</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтадияДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтадияДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>is_ready</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>is_post</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>исх</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>вх</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЗаявлениеОПредоставленииКопииСудебногоАкта/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	
	
		  
	
	
	Если  Параметры.Свойство("ДоговорСтр") Тогда
		      Объект.Владелец=Параметры.ДоговорСтр;
			  Объект.НомерКредитногоДоговора=Параметры.ДоговорСтр.НомерДоговора;
			  Объект.ДатаКредитногоДоговора=Параметры.ДоговорСтр.ДатаФинансирования;
			  
	
	КонецЕсли;
	
	Если  Параметры.Свойство("ДолжникФИО") Тогда
		      Объект.ФИОДолжника=Параметры.ДолжникФИО;
			  
  	КонецЕсли;
	
	
	Если  РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда
		
		      Объект.ДатаСоздания=ТекущаяДата();
        	  Объект.Наименование="Заявления о праве преемственности";


		     Объект.ДатаРожденияДолжника=Параметры.ДатаРожденияДолжника;
	 
			 Объект.АдресРегистрацииДолжника=Параметры.АдресРегистрацииДолжника;

			 Объект.ПаспортныеДанныеДолжника=Параметры.ПаспортныеДанныеДолжника;
			 
			 
			 Объект.МестоРожденияДолжника=Параметры.МестоРожденияДолжника;
			 
			 Объект.НаименованиеПервоначальногоКредитора=Параметры.НаименованиеПервоначальногоКредитора;
			 
			 Объект.НомерДоговораЦессии=Параметры.НомерДоговораЦессии;
			 
			 Объект.ДатаДоговораЦессии=Параметры.ДатаДоговораЦессии;
			 
			 Объект.ТипДокумента=Перечисления.ТипДокумента.исх;
			 
			 Объект.СтадияДокумента=Перечисления.СтадияДокумента.СП;
			 
			 Объект.НаименованиеСуда=Параметры.НазваниеСуда;
			 
             Объект.АдресСуда=Параметры.АдресСудаВкладка;
			 
			 Объект.Исполнитель=Параметры.Исполнитель;
			
			 
			 
	  Иначе
		  
		   Если   ЗначениеЗаполнено(Объект.НазваниеЗаявителя) Тогда
		          ЮридическийАдресЗаявителя=Объект.НазваниеЗаявителя.ЮридическийАдрес;
	              EmailЗаявителя=Объект.НазваниеЗаявителя.ЭлектронныйАдрес;
	              Телефон=Объект.НазваниеЗаявителя.Телефон;
		   	
		   
		   КонецЕсли;
		     
			 
		  
      КонецЕсли;
	  
	
		 
	 
	
	
		
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПрисоединенныеФайлыНажатие(Элемент)
	
	  Если Не Объект.Ссылка.Пустая() Тогда
		  
		    пармСтр=Новый Структура;
		    пармСтр.Вставить("Владелец",Объект.Ссылка);
		    пармСтр.Вставить("ВладелецФайла",Объект.Ссылка);
			
		    ФормаПрисоедФайлы= ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы",пармСтр,Объект.Ссылка);
		  
		  
	  	
	  Иначе 
		  Сообщить("Еще не записан документ, нажмите Записать");
		  
	  КонецЕсли;
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура НазваниеЗаявителяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	
	 НайтиДанныеПолучателя(ВыбранноеЗначение);

	 
	
КонецПроцедуры

&НаСервере
Процедура НайтиДанныеПолучателя(значпор)

	ЮридическийАдресЗаявителя=значпор.ЮридическийАдрес;
	EmailЗаявителя=значпор.ЭлектронныйАдрес;
	Телефон=значпор.Телефон;
	
	
	

КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	  ДвоичныеДанные=ПолучитьФайлИзХран();

	    Если ДвоичныеДанные<>Неопределено  Тогда
			
			Попытка
			
				
				имяД=Строка(Объект.Исполнитель)+"_ЗаявлениеОПроцессуальномПравопреемстве";
				  
				 
				//Shell = Новый COMОбъект("WScript.Shell");
				//дирМоиД=Shell.SpecialFolders.Item("MyDocuments");
				//
				
				//ИмяФайла=дирМоиД+"\"+имяД+".docx"; 	
				
				
				
							
				ИмяФайла=Строка(КаталогВременныхФайлов())+имяД+".docx";
				
				ВыбранныйФайл = Новый Файл(ИмяФайла);
				Если ВыбранныйФайл.Существует() Тогда
					
					УдалитьФайлы(ВыбранныйФайл);
					
				
				КонецЕсли; 

				ДвоичныеДанные.Записать(ИмяФайла);
				
				 MSWord = новый COMОбъект("Word.Application");
				 //Передаем текущие параметры форм в MSWord
				 MSWord.Documents.Open(ИмяФайла);	
				 MSWordDoc = MSWord.ActiveDocument();

				 
				   MSWordDoc.Bookmarks("НаименованиеСуда").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.НаименованиеСуда));
				   
				   //АдресСуда
				   MSWordDoc.Bookmarks("АдресСуда").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.АдресСуда);
				   
				   //ФИОДолжника
				   MSWordDoc.Bookmarks("ФИОДолжника").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника));
				 
					//ДолжникаДатаРождения
	  		       MSWordDoc.Bookmarks("ДолжникаДатаРождения").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаРожденияДолжника;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				   
					//ДолжникАдрес
				   MSWordDoc.Bookmarks("ДолжникАдрес").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.АдресРегистрацииДолжника);
				 
                 
					//СудПоле
				   MSWordDoc.Bookmarks("СудПоле").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.НаименованиеСуда)+" ");
				   
				   
				  // НомерДелаВСуде
				   MSWordDoc.Bookmarks("НомерДелаВСуде").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерСудебногоДела);
				   
				   //ПервоначальныйКредитор
				   MSWordDoc.Bookmarks("ПервоначальныйКредитор").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");
				 
				   
				   //ФИОДолжникПоле
				   MSWordDoc.Bookmarks("ФИОДолжникПоле").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника));
				 
				   //НомерКредитногоДоговора
				   MSWordDoc.Bookmarks("НомерКредитногоДоговора").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
				   
				   //ДатаКредитногоДоговора
				   MSWordDoc.Bookmarks("ДатаКредитногоДоговора").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаКредитногоДоговора;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				   
					
				   //ПервоначальныйКредитор_Между
				    MSWordDoc.Bookmarks("ПервоначальныйКредитор_Между").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.НаименованиеПервоначальногоКредитора)+" ");

				   
				   //НомерЦессии
				   MSWordDoc.Bookmarks("НомерЦессии").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерДоговораЦессии+" ");
				 

				   //ДатаЦессии
				    MSWordDoc.Bookmarks("ДатаЦессии").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаДоговораЦессии;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				   
				   
					//НомерКредитногоДоговора_Между
				   MSWordDoc.Bookmarks("НомерКредитногоДоговора_Между").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
				 
				   
				   //ДатаКредитногоДоговора_Между
				    MSWordDoc.Bookmarks("ДатаКредитногоДоговора_Между").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаКредитногоДоговора;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				  
				   
				   //ПервоначальныйКредитор_М_между
				     MSWordDoc.Bookmarks("ПервоначальныйКредитор_М_между").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");

				   
				   //ФИОДолжника_Между
				     MSWordDoc.Bookmarks("ФИОДолжника_Между").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника));
				 

				   //НомерЦессии_Переход
				    MSWordDoc.Bookmarks("НомерЦессии_Переход").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерДоговораЦессии+" ");

				   //ДатаЦессии_Переход
				     MSWordDoc.Bookmarks("ДатаЦессии_Переход").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаДоговораЦессии;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);
				
				   
				   //ПервоначальныйКредитор_Также
				   MSWordDoc.Bookmarks("ПервоначальныйКредитор_Также").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");

				   //НомерДелаВСуде_Прошу
				   MSWordDoc.Bookmarks("НомерДелаВСуде_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерСудебногоДела);
				   
				   //ДатаДелаВСуде
				   MSWordDoc.Bookmarks("ДатаДелаВСуде").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаСудебногоДела;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);


				   //ПервоначальныйКредитор_Прошу
				   MSWordDoc.Bookmarks("ПервоначальныйКредитор_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");

				   
				   //ФИОДолжника_Прошу
				   MSWordDoc.Bookmarks("ФИОДолжника_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Строка(Объект.ФИОДолжника));

				   
				   //НомерКредитногоДоговора_Прошу
				     MSWordDoc.Bookmarks("НомерКредитногоДоговора_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерКредитногоДоговора);
				 
				   //ДатаКредитногоДоговора_Прошу
				      MSWordDoc.Bookmarks("ДатаКредитногоДоговора_Прошу").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаКредитногоДоговора;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   длина=СтрДлина(дат);
				   дат=Лев(дат,длина-2);
				   MSWordDoc.Application.Selection.TypeText(дат);
				  
				   
				   //ПервоначальныйКредитор_Прошу_2
				    MSWordDoc.Bookmarks("ПервоначальныйКредитор_Прошу_2").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НаименованиеПервоначальногоКредитора+" ");

				   
				   
				   //НомерЦессии_Приложение
				   MSWordDoc.Bookmarks("НомерЦессии_Приложение").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерДоговораЦессии+" ");

				   
				   //ДатаЦессии_Приложение
				        MSWordDoc.Bookmarks("ДатаЦессии_Приложение").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаДоговораЦессии;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   длина=СтрДлина(дат);
				   дат=Лев(дат,длина-2);
                   MSWordDoc.Application.Selection.TypeText(дат);
				

				   //НомерЦессии_Приложение_Выписка
				     MSWordDoc.Bookmarks("НомерЦессии_Приложение_Выписка").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
                   MSWordDoc.Application.Selection.TypeText(Объект.НомерДоговораЦессии+" ");

				   
				   //ДатаЦессии_Приложение_Выписка
				          MSWordDoc.Bookmarks("ДатаЦессии_Приложение_Выписка").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=Объект.ДатаДоговораЦессии;
				   дат= Формат(датРож, "ДЛФ=ДД");
				   длина=СтрДлина(дат);
				   дат=Лев(дат,длина-2);
                   MSWordDoc.Application.Selection.TypeText(дат);
				

				   //ДатаЗаявления
				     MSWordDoc.Bookmarks("ДатаЗаявления").Select();
				   MSWordDoc.Application.Selection.Font.Color = 1;
				   датРож=ТекущаяДата();
				   дат= Формат(датРож, "ДЛФ=ДД");
				   MSWordDoc.Application.Selection.TypeText(дат);

				   
				   
				  MSWord.Visible=1;
				  MSWord.Activate();

				  
				  
				  
				  
			
			Исключение
				
				Сообщить("Ошибка----- Печать Заявление О Процессуальном Правопреемстве");
				ТекстОшибки = ОписаниеОшибки();
				Сообщить(ТекстОшибки);

				
				
			КонецПопытки;
			
			
		КонецЕсли;	
	
	
	
КонецПроцедуры

 
 
&НаСервере
Функция ПолучитьФайлИзХран()
	
	 
	   НайтиШабл = Справочники.ШаблоныЮристы.НайтиПоНаименованию("ШаблонЗаявлениеОПроцессуальномПравопреемстве",ИСТИНА);
	 
	     Двоичные=Неопределено;
		 
		 Если НайтиШабл<>Неопределено Тогда
		 
		 	 Если НЕ НайтиШабл.ПУСТАЯ() Тогда  
 
        		Хран=НайтиШабл.ФайлШаблона;
        		Двоичные=Хран.Получить(); 
    			
    		КонецЕсли;
			

		 
		 КонецЕсли; 
    	
			
	  Возврат Двоичные;		
	 

КонецФункции // ()
